routes/employee.php


    Route::get('MyCertificate', [CertificateController::class, 'show'])->name('MyCertificate');
    Route::get('ReviewCertificates', [CertificateController::class, 'showcertificatereviewer'])->name('ReviewCertificates');
    Route::get('ApprovalCertificates', function () {
        $id = Auth::guard('employee')->user()->id ?? null;
        $certificates = DB::table('certificate')->get();
        foreach ($certificates as $certificate) {
            $employee = DB::table('employees')->where('id', '=', $certificate->Emp_id ?? "")->get();
        }
        $certificatespending = DB::table('certificate')->where('review_status', '=', 'ConfirmCertificate')->where('approval_status', '=', null)->get();
        $certificatesreturn = DB::table('certificate')->where('approval_status', '=', 'Return To Sender')->get();
        $certificatesapproval = DB::table('certificate')->where('approval_status', '=', 'ConfirmCertificate')->get();
        return view('Dashboard.employee.Personal_Certificate.Approval_Certificates', ['employee' => $employee, 'certificates' => $certificates, 'certificatespending' => $certificatespending, 'certificatesreturn' => $certificatesreturn, 'certificatesapproval' => $certificatesapproval]);
    })->name('ApprovalCertificates');
---
select * from `certificate` where `approval_status` = 'ConfirmCertificate'
select * from `certificate`
select * from `employees` where `id` = 3
select * from `certificate` where `review_status` = 'ConfirmCertificate' and `approval_status` is null
select * from `certificate` where `approval_status` = 'Return To Sender'