app/Http/Controllers/CertificateController.php

    public function show(Request $request)
    {


        $id= Auth::guard('employee')->user()->id??null;

        $certificates = DB::table('certificate')->where('Emp_id','=',$id)->get();


//        foreach ($certificates as $certificate)
//        {
            $employee= DB::table('employees')->where('id','=',$id)->first();
//        }


        $currentdate=now();
        $certificatesPending = DB::table('certificate')
            ->where('Emp_id', '=', $id)
            ->where(function($query) {$query->where('approval_status','=',null)->orWhere('approval_status','=','Return To Sender');})
            ->where(function($query) {$query->where('review_status', '=', 'ConfirmCertificate')->orWhere('review_status');})->get();
        $certificatesreturn = DB::table('certificate')->where('Emp_id', '=', $id)->Where('review_status', '=', 'Return To Sender')->get();
        $certificatesapproval = DB::table('certificate')->where('Emp_id', '=', $id)->where('approval_status', '=', 'ConfirmCertificate')->get();
---
select * from `certificate` where `Emp_id` = 3
select * from `employees` where `id` = 3 limit 1
select * from `certificate` where `Emp_id` = 3 and (`approval_status` is null or `approval_status` = 'Return To Sender') and (`review_status` = 'ConfirmCertificate' or `review_status` is null)
select * from `certificate` where `Emp_id` = 3 and `review_status` = 'Return To Sender'
select * from `certificate` where `Emp_id` = 3 and `approval_status` = 'ConfirmCertificate'

    public function showcertificatereviewer()
    {
        $id= Auth::guard('employee')->user()->id??null;
        $certificates = DB::table('certificate')->get();
        $certificatespending = DB::table('certificate')->where('review_status','=',null)->get();
        $certificatesreturn = DB::table('certificate')->where('review_status','=','Return To Sender')->get();
        $certificatesapproval = DB::table('certificate')->where('review_status','=','ConfirmCertificate')->get();
        $currentdate=now();
        $employeepend=[];
        $employeereturn=[];
        $employeeapproval=[];
           foreach ($certificatespending as $certificate) {
             $employee= DB::table('employees')->where('id','=',$certificate->Emp_id??"")->get();
             $employeepend[]=$employee;


           }
        foreach ($certificatesreturn as $certificate) {
            $employee= DB::table('employees')->where('id','=',$certificate->Emp_id??"")->get();
            $employeereturn[]=$employee;

        }
        foreach ($certificatesapproval as $certificate) {
            $employee= DB::table('employees')->where('id','=',$certificate->Emp_id??"")->first();
---
select * from `certificate`
select * from `certificate` where `review_status` is null
select * from `certificate` where `review_status` = 'Return To Sender'
select * from `certificate` where `review_status` = 'ConfirmCertificate'
select * from `employees` where `id` = 3
select * from `employees` where `id` = 3 limit 1